#pragma warning disable
// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе 
// показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

int a;
Console.WriteLine("Введите число");
int.TryParse(Console.ReadLine()!);

if()


